iwasz/zephyr-grbl/modules/hw_timer/zephyr/hw_timer_stm32.c
	if ((channel != 1u) && (channel != 2u)) {
		LOG_ERR("HW_TIMER capture only supported on first two channels");
		return -ENOTSUP;
	}

	if (LL_TIM_IsEnabledIT_CC1(cfg->timer) || LL_TIM_IsEnabledIT_CC2(cfg->timer)) {
		LOG_ERR("HW_TIMER Capture already in progress");
		return -EBUSY;
	}

	if (!(flags & HW_TIMER_CAPTURE_TYPE_MASK)) {
		LOG_ERR("No HW_TIMER capture type specified");
		return -EINVAL;
	}

	if (!IS_TIM_SLAVE_INSTANCE(cfg->timer)) {
		LOG_ERR("Timer does not support slave mode for HW_TIMER capture");
		return -ENOTSUP;
	}

	cpt->callback = cb; /* even if the cb is reset, this is not an error */
	cpt->user_data = user_data;
	cpt->capture_period = (flags & HW_TIMER_CAPTURE_TYPE_PERIOD) ? true : false;
	cpt->capture_pulse = (flags & HW_TIMER_CAPTURE_TYPE_PULSE) ? true : false;
	cpt->continuous = (flags & HW_TIMER_CAPTURE_MODE_CONTINUOUS) ? true : false;

	/* Prevents faulty behavior while making changes */
	LL_TIM_SetSlaveMode(cfg->timer, LL_TIM_SLAVEMODE_DISABLED);

	ret = init_capture_channel(dev, channel, flags, LL_TIM_CHANNEL_CH1);
	if (ret < 0) {
		return ret;
	}

	ret = init_capture_channel(dev, channel, flags, LL_TIM_CHANNEL_CH2);
	if (ret < 0) {
		return ret;
	}

	if (channel == 1u) {
		LL_TIM_SetTriggerInput(cfg->timer, LL_TIM_TS_TI1FP1);
	} else {
		LL_TIM_SetTriggerInput(cfg->timer, LL_TIM_TS_TI2FP2);
	}
	LL_TIM_SetSlaveMode(cfg->timer, LL_TIM_SLAVEMODE_RESET);

	LL_TIM_EnableARRPreload(cfg->timer);
	if (!IS_TIM_32B_COUNTER_INSTANCE(cfg->timer)) {
		LL_TIM_SetAutoReload(cfg->timer, 0xffffu);
	} else {
		LL_TIM_SetAutoReload(cfg->timer, 0xffffffffu);
	}
	LL_TIM_EnableUpdateEvent(cfg->timer);

	return 0;
}

static int hw_timer_stm32_enable_capture(const struct device *dev, uint32_t channel)
{
	const struct hw_timer_stm32_config *cfg = dev->config;
	struct hw_timer_stm32_data *data = dev->data;

	if ((channel != 1u) && (channel != 2u)) {
		LOG_ERR("HW_TIMER capture only supported on first two channels");
		return -EINVAL;
	}

	if (LL_TIM_IsEnabledIT_CC1(cfg->timer) || LL_TIM_IsEnabledIT_CC2(cfg->timer)) {
		LOG_ERR("HW_TIMER capture already active");
		return -EBUSY;
	}

	if (!data->capture.callback) {
		LOG_ERR("HW_TIMER capture not configured");
		return -EINVAL;
	}

	data->capture.skip_irq = SKIPPED_HW_TIMER_CAPTURES;
	data->capture.overflows = 0u;
	LL_TIM_ClearFlag_CC1(cfg->timer);
	LL_TIM_ClearFlag_CC2(cfg->timer);
	LL_TIM_ClearFlag_UPDATE(cfg->timer);

	LL_TIM_SetUpdateSource(cfg->timer, LL_TIM_UPDATESOURCE_COUNTER);
	if (channel == 1u) {
		LL_TIM_EnableIT_CC1(cfg->timer);
	} else {
		LL_TIM_EnableIT_CC2(cfg->timer);
	}
	LL_TIM_EnableIT_UPDATE(cfg->timer);
	LL_TIM_CC_EnableChannel(cfg->timer, LL_TIM_CHANNEL_CH1);
	LL_TIM_CC_EnableChannel(cfg->timer, LL_TIM_CHANNEL_CH2);

	return 0;
}

static int hw_timer_stm32_disable_capture(const struct device *dev, uint32_t channel)
{
	const struct hw_timer_stm32_config *cfg = dev->config;

	if ((channel != 1u) && (channel != 2u)) {
		LOG_ERR("HW_TIMER capture only supported on first two channels");
		return -EINVAL;
	}

	LL_TIM_SetUpdateSource(cfg->timer, LL_TIM_UPDATESOURCE_REGULAR);
	if (channel == 1u) {
		LL_TIM_DisableIT_CC1(cfg->timer);
	} else {
		LL_TIM_DisableIT_CC2(cfg->timer);
	}
	LL_TIM_DisableIT_UPDATE(cfg->timer);
	LL_TIM_CC_DisableChannel(cfg->timer, LL_TIM_CHANNEL_CH1);
	LL_TIM_CC_DisableChannel(cfg->timer, LL_TIM_CHANNEL_CH2);

	return 0;
}

static void get_hw_timer_capture(const struct device *dev, uint32_t channel)
{
	const struct hw_timer_stm32_config *cfg = dev->config;
	struct hw_timer_stm32_data *data = dev->data;
	struct hw_timer_stm32_capture_data *cpt = &data->capture;

	if (channel == 1u) {
		cpt->period = LL_TIM_IC_GetCaptureCH1(cfg->timer);
		cpt->pulse = LL_TIM_IC_GetCaptureCH2(cfg->timer);
	} else {
		cpt->period = LL_TIM_IC_GetCaptureCH2(cfg->timer);
		cpt->pulse = LL_TIM_IC_GetCaptureCH1(cfg->timer);
	}
}

static void hw_timer_stm32_isr(const struct device *dev)
{
	const struct hw_timer_stm32_config *cfg = dev->config;
	struct hw_timer_stm32_data *data = dev->data;
	struct hw_timer_stm32_capture_data *cpt = &data->capture;
	int status = 0;
	uint32_t in_ch = LL_TIM_IsEnabledIT_CC1(cfg->timer) ? 1u : 2u;

	if (cpt->skip_irq == 0u) {
		if (LL_TIM_IsActiveFlag_UPDATE(cfg->timer)) {
			LL_TIM_ClearFlag_UPDATE(cfg->timer);
			cpt->overflows++;
		}

		if (LL_TIM_IsActiveFlag_CC1(cfg->timer) || LL_TIM_IsActiveFlag_CC2(cfg->timer)) {
			LL_TIM_ClearFlag_CC1(cfg->timer);
			LL_TIM_ClearFlag_CC2(cfg->timer);

			get_hw_timer_capture(dev, in_ch);

			if (cpt->overflows) {
				LOG_ERR("counter overflow during HW_TIMER capture");
				status = -ERANGE;
			}

			if (!cpt->continuous) {
				hw_timer_stm32_disable_capture(dev, in_ch);
			} else {
				cpt->overflows = 0u;
			}

			if (cpt->callback != NULL) {
				cpt->callback(dev, in_ch, cpt->capture_period ? cpt->period : 0u,
					      cpt->capture_pulse ? cpt->pulse : 0u, status,
					      cpt->user_data);
			}
		}
	} else {
		if (LL_TIM_IsActiveFlag_UPDATE(cfg->timer)) {
			LL_TIM_ClearFlag_UPDATE(cfg->timer);
		}

		if (LL_TIM_IsActiveFlag_CC1(cfg->timer) || LL_TIM_IsActiveFlag_CC2(cfg->timer)) {
			LL_TIM_ClearFlag_CC1(cfg->timer);
			LL_TIM_ClearFlag_CC2(cfg->timer);
			cpt->skip_irq--;
		}
	}
}
#endif /* CONFIG_HW_TIMER_CAPTURE */

static int hw_timer_stm32_get_cycles_per_sec(const struct device *dev, uint32_t channel,
					     uint64_t *cycles)
{
	struct hw_timer_stm32_data *data = dev->data;
	const struct hw_timer_stm32_config *cfg = dev->config;

	*cycles = (uint64_t)(data->tim_clk / (cfg->prescaler + 1));

	return 0;
}

/**
 * On timer update.
 */
void hw_timer_stm32_up_isr(const void *arg)
{
	struct device *dev = (struct device *)arg;
	struct hw_timer_stm32_data *data = dev->data;
	const struct hw_timer_stm32_config *cfg = dev->config;

	if (LL_TIM_IsActiveFlag_UPDATE(cfg->timer)) {
		LL_TIM_ClearFlag_UPDATE(cfg->timer);

		if (data->timer_up_callback) {
			(*data->timer_up_callback)(/* dev */);
		}
	}
}

/**
 * Set or remove the update callback.
 */
void hw_timer_stm32_set_update_callback(const struct device *dev, timer_callback_t callback)
{
	struct hw_timer_stm32_data *data = dev->data;
	data->timer_up_callback = callback;
	const struct hw_timer_stm32_config *cfg = dev->config;

