iwasz/zephyr-grbl/modules/hw_timer/zephyr/hw_timer_stm32.c
	// TODO some timers have 4 IRQs while others have only one
	const int up_irqn = DT_IRQ_BY_IDX(DT_PARENT(DT_DRV_INST(0)), 0, irq);
	const int up_priority = DT_IRQ_BY_IDX(DT_PARENT(DT_DRV_INST(0)), 0, priority);

	LL_TIM_ClearFlag_UPDATE(cfg->timer);

	if (callback) {
		LL_TIM_EnableIT_UPDATE(cfg->timer);
		irq_connect_dynamic(up_irqn, up_priority, hw_timer_stm32_up_isr, dev, 0);

		irq_enable(up_irqn);
	} else {
		irq_disable(up_irqn);
		LL_TIM_DisableIT_UPDATE(cfg->timer);
	}
}

static const struct hw_timer_driver_api hw_timer_stm32_driver_api = {
	.set_cycles = hw_timer_stm32_set_cycles,
	.get_cycles_per_sec = hw_timer_stm32_get_cycles_per_sec,
#ifdef CONFIG_HW_TIMER_CAPTURE
	.configure_capture = hw_timer_stm32_configure_capture,
	.enable_capture = hw_timer_stm32_enable_capture,
	.disable_capture = hw_timer_stm32_disable_capture,
#endif /* CONFIG_HW_TIMER_CAPTURE */
	.set_update_callback = hw_timer_stm32_set_update_callback,
};

static int hw_timer_stm32_init(const struct device *dev)
{
	struct hw_timer_stm32_data *data = dev->data;
	const struct hw_timer_stm32_config *cfg = dev->config;

	int r;
	const struct device *clk;
	LL_TIM_InitTypeDef init;

	/* enable clock and store its speed */
	clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	if (!device_is_ready(clk)) {
		LOG_ERR("clock control device not ready");
		return -ENODEV;
	}

	r = clock_control_on(clk, (clock_control_subsys_t)&cfg->pclken);
	if (r < 0) {
		LOG_ERR("Could not initialize clock (%d)", r);
		return r;
	}

	r = get_tim_clk(&cfg->pclken, &data->tim_clk);
	if (r < 0) {
		LOG_ERR("Could not obtain timer clock (%d)", r);
		return r;
	}

	/* configure pinmux */
	r = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (r < 0) {
		LOG_ERR("HW_TIMER pinctrl setup failed (%d)", r);
		return r;
	}

	/* initialize timer */
	LL_TIM_StructInit(&init);

	init.Prescaler = cfg->prescaler;
	init.CounterMode = cfg->countermode;
	init.Autoreload = 0u;
	init.ClockDivision = LL_TIM_CLOCKDIVISION_DIV1;

	if (LL_TIM_Init(cfg->timer, &init) != SUCCESS) {
		LOG_ERR("Could not initialize timer");
		return -EIO;
	}

#if !defined(CONFIG_SOC_SERIES_STM32L0X) && !defined(CONFIG_SOC_SERIES_STM32L1X)
	/* enable outputs and counter */
	if (IS_TIM_BREAK_INSTANCE(cfg->timer)) {
		LL_TIM_EnableAllOutputs(cfg->timer);
	}
#endif

	LL_TIM_EnableCounter(cfg->timer);

#ifdef CONFIG_HW_TIMER_CAPTURE
	cfg->irq_config_func(dev);
#endif /* CONFIG_HW_TIMER_CAPTURE */

	return 0;
}

#ifdef CONFIG_HW_TIMER_CAPTURE
#define IRQ_CONNECT_AND_ENABLE_BY_NAME(index, name)                                                \
	{                                                                                          \
		IRQ_CONNECT(DT_IRQ_BY_NAME(DT_INST_PARENT(index), name, irq),                      \
			    DT_IRQ_BY_NAME(DT_INST_PARENT(index), name, priority),                 \
			    hw_timer_stm32_isr, DEVICE_DT_INST_GET(index), 0);                     \
		irq_enable(DT_IRQ_BY_NAME(DT_INST_PARENT(index), name, irq));                      \
	}

#define IRQ_CONNECT_AND_ENABLE_DEFAULT(index)                                                      \
	{                                                                                          \
		IRQ_CONNECT(DT_IRQN(DT_INST_PARENT(index)),                                        \
			    DT_IRQ(DT_INST_PARENT(index), priority), hw_timer_stm32_isr,           \
			    DEVICE_DT_INST_GET(index), 0);                                         \
		irq_enable(DT_IRQN(DT_INST_PARENT(index)));                                        \
	}

#define IRQ_CONFIG_FUNC(index)                                                                     \
	static void hw_timer_stm32_irq_config_func_##index(const struct device *dev)               \
	{                                                                                          \
		COND_CODE_1(DT_IRQ_HAS_NAME(DT_INST_PARENT(index), cc),                            \
			    (IRQ_CONNECT_AND_ENABLE_BY_NAME(index, cc)),                           \
			    (IRQ_CONNECT_AND_ENABLE_DEFAULT(index)));                              \
	}
#define CAPTURE_INIT(index) .irq_config_func = hw_timer_stm32_irq_config_func_##index
#else
#define IRQ_CONFIG_FUNC(index)
#define CAPTURE_INIT(index)
#endif /* CONFIG_HW_TIMER_CAPTURE */

#define DT_INST_CLK(index, inst)                                                                   \
	{                                                                                          \
		.bus = DT_CLOCKS_CELL(DT_INST_PARENT(index), bus),                                 \
		.enr = DT_CLOCKS_CELL(DT_INST_PARENT(index), bits)                                 \
	}

#define HW_TIMER_DEVICE_INIT(index)                                                                \
	static struct hw_timer_stm32_data hw_timer_stm32_data_##index;                             \
	IRQ_CONFIG_FUNC(index)                                                                     \
                                                                                                   \
	PINCTRL_DT_INST_DEFINE(index);                                                             \
                                                                                                   \
	static const struct hw_timer_stm32_config hw_timer_stm32_config_##index = {                \
		.timer = (TIM_TypeDef *)DT_REG_ADDR(DT_INST_PARENT(index)),                        \
		.prescaler = DT_PROP(DT_INST_PARENT(index), st_prescaler),                         \
		.countermode = DT_PROP(DT_INST_PARENT(index), st_countermode),                     \
		.pclken = DT_INST_CLK(index, timer),                                               \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                                     \
		CAPTURE_INIT(index)                                                                \
	};                                                                                         \
                                                                                                   \
	DEVICE_DT_INST_DEFINE(index, &hw_timer_stm32_init, NULL, &hw_timer_stm32_data_##index,     \
			      &hw_timer_stm32_config_##index, POST_KERNEL,                         \
			      CONFIG_HW_TIMER_INIT_PRIORITY, &hw_timer_stm32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(HW_TIMER_DEVICE_INIT)
